.data
data: .word 1

.text
    la   x10, data       # Φόρτωση της διεύθυνσης του data στον x10
    li   x11, 0          # Αρχικοποίηση του x11 με 0
    li   x9,  -1         # Αρχικοποίηση του x9 με -1

loop:
l1: addi x10, x10, 4      # Μετακίνηση στη διεύθυνση του επόμενου word
    lw   x5, 0(x10)       # Φόρτωση τιμής από τη μνήμη
    beq  x10, x11, out    # Έλεγχος για έξοδο
    beq  x5, x9, out      # Έλεγχος για έξοδο αν η τιμή είναι -1
    add  x5, x5, x5       # Διπλασιασμός τιμής
    sw   x5, 0(x10)       # Αποθήκευση της τιμής πίσω στη μνήμη
    j    loop             # Επιστροφή στην αρχή του βρόχου

out: 
    li a7, 93             # Κωδικός για τερματισμό (Exit2)
    li a0, 0              # Επιστροφή με κωδικό εξόδου 0
    ecall
